Revit 2027 API
RebarContainerItem.FindMatchingPredefinedPresentationMode Method
 Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarPresentationMode FindMatchingPredefinedPresentationMode(
	View dBView
)
Public Function FindMatchingPredefinedPresentationMode (
	dBView As View
) As RebarPresentationMode
public:
RebarPresentationMode FindMatchingPredefinedPresentationMode(
	View^ dBView
)
member FindMatchingPredefinedPresentationMode :
        dBView : View -> RebarPresentationMode
Parameters
dBView View
 The view.
Return Value
RebarPresentationMode
 The presentation mode that matches the current set of selected hidden and unhidden bars. If there is no better match, this returns RebarPresentationMode.Select.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the presentation mode is not PresentationMode.Select for the view, this function returns the current mode.
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace